#ifndef __CAN1_c__
#define __CAN1_c__

#include "CAN1.h"
#include "opora.h"
#include "config.h"

//--- CAN1 Config ---
void CAN1Config()
{
#if CAN_1 == 1

#ifdef REVISION_2

	#ifdef SPEED_1000K
		CAN1->BITTMNG = 0x08900002;			//CAN1 speed 1 Mbit/s	
	// CAN1->BITTMNG - Регистр задания скорости работы
// ╔═════════╦════════════════╦════════════════════════════════════════════════════════════════════════════════════╗
// ║ 	 Биты  ║ Поле           ║                 Назначение                                                         ║
// ╠═════════╬════════════════╬════════════════════════════════════════════════════════════════════════════════════╣
// ║  31..28 ║     -          ║ Зарезервировано                                                                    ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   27    ║    SB          ║ Семплирование:                                                                     ║
// ║         ║                ║ 0 - однократное;                                                                   ║
// ║         ║                ║ 1 - трёхкратное с мажоритарным контролем                                           ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║  27..25 ║   SJW[1:0]     ║ Значение размера фазы SJW                                                          ║
// ║         ║                ║ 00 = Synchronization jump width time = 1 x TQ                                      ║
// ║         ║                ║ 01 = Synchronization jump width time = 2 x TQ                                      ║
// ║         ║                ║ 10 = Synchronization jump width time = 3 x TQ                                      ║
// ║         ║                ║ 11 = Synchronization jump width time = 4 x TQ                                      ║
// ║         ║                ║ SJW - это максимальное значение, на которое происходит подстройка приёма и передачи║
// ║         ║                ║ при работе на шине CAN. Приёмник подстраивается на значение ошибки, но не более    ║
// ║         ║                ║ SJW.                                                                               ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║  24..22 ║   SEG2[2:0]    ║ Значение размера фазы SEG2                                                         ║
// ║         ║                ║ 000 = Phase Segment 2 time = 1 x TQ                                                ║
// ║         ║                ║ 001 = Phase Segment 2 time = 2 x TQ                                                ║
// ║         ║                ║ 010 = Phase Segment 2 time = 3 x TQ                                                ║
// ║         ║                ║ 011 = Phase Segment 2 time = 4 x TQ                                                ║
// ║         ║                ║ 100 = Phase Segment 2 time = 5 x TQ                                                ║
// ║         ║                ║ 101 = Phase Segment 2 time = 6 x TQ                                                ║
// ║         ║                ║ 110 = Phase Segment 2 time = 7 x TQ                                                ║
// ║         ║                ║ 111 = Phase Segment 2 time = 8 x TQ                                                ║
// ║         ║                ║ SEG2 - это время, используемое для сокращения битового интервала при подстройке.   ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║  21..19 ║   SEG1[2:0]    ║ Значение размера фазы SEG1                                                         ║
// ║         ║                ║ 000 = Phase Segment 2 time = 1 x TQ                                                ║
// ║         ║                ║ 001 = Phase Segment 2 time = 2 x TQ                                                ║
// ║         ║                ║ 010 = Phase Segment 2 time = 3 x TQ                                                ║
// ║         ║                ║ 011 = Phase Segment 2 time = 4 x TQ                                                ║
// ║         ║                ║ 100 = Phase Segment 2 time = 5 x TQ                                                ║
// ║         ║                ║ 101 = Phase Segment 2 time = 6 x TQ                                                ║
// ║         ║                ║ 110 = Phase Segment 2 time = 7 x TQ                                                ║
// ║         ║                ║ 111 = Phase Segment 2 time = 8 x TQ                                                ║
// ║         ║                ║ SEG1 - это время, используемое для увеличения битового интервала при подстройке.   ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║  18..16 ║   PSEG[2:0]    ║ Значение размера фазы PSEG                                                         ║
// ║         ║                ║ 000 = Propagation time = 1 x TQ                                                    ║
// ║         ║                ║ 001 = Propagation time = 2 x TQ                                                    ║
// ║         ║                ║ 010 = Propagation time = 3 x TQ                                                    ║
// ║         ║                ║ 011 = Propagation time = 4 x TQ                                                    ║
// ║         ║                ║ 100 = Propagation time = 5 x TQ                                                    ║
// ║         ║                ║ 101 = Propagation time = 6 x TQ                                                    ║
// ║         ║                ║ 110 = Propagation time = 7 x TQ                                                    ║
// ║         ║                ║ 111 = Propagation time = 8 x TQ                                                    ║
// ║         ║                ║ PSEG - это время, компенсирующее задержку распространения сигналов в шине CAN.     ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║  15..0  ║   BRP[15:0]    ║ Предделитель системной частоты                                                     ║
// ║         ║                ║ CLK = PCLK/(BRP+1);                                                                ║
// ║         ║                ║ TQ(us) = (BRP+1)/CLK(MHz)                                                          ║
// ╚═════════╩════════════════╩════════════════════════════════════════════════════════════════════════════════════╝
	#endif	//SPEED_1000K
		
	#ifdef SPEED_500K
		CAN1->BITTMNG =	0x08900005;			//CAN1 speed 500 kbit/s
	#endif	//SPEED_500K

	#ifdef SPEED_250K
		CAN1->BITTMNG =	0x0890000B;			//CAN1 speed 250 kbit/s
	#endif	//SPEED_250K

#else

	#ifdef SPEED_1000K
		CAN1->BITTMNG = 0x01FF0000;			//CAN1 speed 1 Mbit/s
	#endif	//SPEED_1000K

	#ifdef SPEED_500K
		CAN1->BITTMNG =	0x01FF0001;			//CAN1 speed 500 kbit/s
	#endif	//SPEED_500K

	#ifdef SPEED_250K
		CAN1->BITTMNG =	0x01FF0003;			//CAN1 speed 250 kbit/s
	#endif	//SPEED_250K

#endif	//REVISION_2

	CAN1->BUF_01_CON = 0x00000003;		//Buffer 1 - Rx and enable
// CAN1->BUF_01_CON - Регистр управления буфером 01
// ╔═════════╦════════════════╦════════════════════════════════════════════════════════════════════════════════════╗
// ║ 	 Биты  ║ Поле           ║                 Назначение                                                         ║
// ╠═════════╬════════════════╬════════════════════════════════════════════════════════════════════════════════════╣
// ║  31..8  ║                ║ Зарезервировано.                                                                   ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   7     ║  OVER_WR       ║ Флаг перезаписи принятого сообщения                                                ║
// ║         ║                ║ 0 - не было перезаписи                                                             ║
// ║         ║                ║ 1 - была перезапись принятого сообщения                                            ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   6     ║  RX_FULL       ║ Флаг готовности приёма                                                             ║
// ║         ║                ║ 0 - нет принятого сообщения                                                        ║
// ║         ║                ║ 1 - принятое сообщение в буфере                                                    ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   5     ║  TX_REQ        ║ Запрос на отправку сообщения                                                       ║
// ║         ║                ║ 0 - нет запроса или отправлено                                                     ║
// ║         ║                ║ 1 - запрос на отправку                                                             ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   4     ║  PRIOR_0       ║ Приоритет при отправке                                                             ║
// ║         ║                ║ 0 - нет приоритета                                                                 ║
// ║         ║                ║ 1 - приоритет                                                                      ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   3     ║  RTR_EN        ║ Режим ответа на RTR                                                                ║
// ║         ║                ║ 1 - ответить при приёме RTR в буфер                                                ║
// ║         ║                ║ 0 - не отвечать при приёме RTR                                                     ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   2     ║  OVER_EN       ║ Разрешение перезаписи принятого сообщения                                          ║
// ║         ║                ║ 1 - разрешена перезапись сообщения                                                 ║
// ║         ║                ║ 0 - не разрешена перезапись                                                        ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   1     ║  RX_TXn        ║ Режим работы буфера                                                                ║
// ║         ║                ║ 1 - на приём                                                                       ║
// ║         ║                ║ 0 - на передачу                                                                    ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   0     ║  EN            ║ Разрешение работы буфера                                                           ║
// ║         ║                ║ 1 - работает                                                                       ║
// ║         ║                ║ 0 - отключен                                                                       ║
// ╚═════════╩════════════════╩════════════════════════════════════════════════════════════════════════════════════╝
	CAN1->BUF_02_CON = 0x00000001;		//Buffer 2 - Tx and enable
	CAN1->INT_EN = 0;					//all interrupts disable
	// CAN1->INT_EN - 
// ╔═════════╦════════════════╦════════════════════════════════════════════════════════════════════════════════════╗
// ║ 	 Биты  ║ Поле           ║                 Назначение                                                         ║
// ╠═════════╬════════════════╬════════════════════════════════════════════════════════════════════════════════════╣
// ║ 31..5   ║                ║ Зарезервировано                                                                    ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   4     ║ ERROVERINTEN   ║ Флаг разрешения прерывания по превышению TEC или REC допустимого значения в        ║
// ║         ║                ║ ERROR_MAX                                                                          ║
// ║         ║                ║ 0 - запрещено прерывание                                                           ║
// ║         ║                ║ 1 - разрешено прерывание                                                           ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   3     ║ ERRINTEN       ║ Флаг разрешения прерывания по возникновению ошибки                                 ║
// ║         ║                ║ 0 - запрещено прерывание                                                           ║
// ║         ║                ║ 1 - разрешено прерывание                                                           ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   2     ║ TXINTEN        ║ Флаг разрешения прерывания по возможности передачи                                 ║
// ║         ║                ║ 0 - запрещено прерывание                                                           ║
// ║         ║                ║ 1 - разрешено прерывание                                                           ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   1     ║ RXINTEN        ║ Флаг разрешения прерывания по приёму сообщений                                     ║
// ║         ║                ║ 0 - запрещение прерывание                                                          ║
// ║         ║                ║ 1 - разрешено прерывание                                                           ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   0     ║ GLBINTEN       ║ Общий флаг разрешения прерывания блока CAN                                         ║
// ║         ║                ║ 0 - запрещено прерывание                                                           ║
// ║         ║                ║ 1 - разрешено прерывание                                                           ║
// ╚═════════╩════════════════╩════════════════════════════════════════════════════════════════════════════════════╝
	CAN1->INT_RX = 0;					//Rx interrupts disable
	// CAN1->INT_RX - Регистр прерываний от приёмника
// ╔═════════╦════════════════╦════════════════════════════════════════════════════════════════════════════════════╗
// ║ 	 Биты  ║ Поле           ║                 Назначение                                                         ║
// ╠═════════╬════════════════╬════════════════════════════════════════════════════════════════════════════════════╣
// ║  31..0  ║  CAN_RX[31:0]  ║ Флаги разрешения прерываний от буферов по приёму сообщений                         ║
// ║         ║                ║ CAN_INT_RX[0] - для первого буфера                                                 ║
// ║         ║                ║ CAN_INT_RX[1] - для второго буфера и так далее                                     ║
// ╚═════════╩════════════════╩════════════════════════════════════════════════════════════════════════════════════╝
	CAN1->INT_TX = 0;					//Tx interrupts disable
	// CAN1->INT_TX - Регистр прерываний от передатчика
// ╔═════════╦════════════════╦════════════════════════════════════════════════════════════════════════════════════╗
// ║ 	 Биты  ║ Поле           ║                 Назначение                                                         ║
// ╠═════════╬════════════════╬════════════════════════════════════════════════════════════════════════════════════╣
// ║  31..0  ║  CAN_TX[31:0]  ║ Флаги разрешения прерываний от буферов по передаче сообщений                       ║
// ║         ║                ║ CAN_INT_TX[0] - для первого буфера                                                 ║
// ║         ║                ║ CAN_INT_TX[1] - для второго буфера и так далее                                     ║
// ╚═════════╩════════════════╩════════════════════════════════════════════════════════════════════════════════════╝	
	CAN1->BUF_02_ID = 0x555<<18;		// 10101010101 - SID; 0 - EID

	CAN1->BUF_02_DLC = 0x00000A08;		// IDE = 0; SSR = 1; R0 = 0; R1 = 1; RTR = 0; DLC = 8 bytes
// CAN1->BUF_02_DLC - Регистр               
// ╔═════════╦════════════════╦════════════════════════════════════════════════════════════════════════════════════╗
// ║ 	 Биты  ║ Поле           ║                 Назначение                                                         ║
// ╠═════════╬════════════════╬════════════════════════════════════════════════════════════════════════════════════╣
// ║  31..13 ║                ║ Зарезервировано                                                                    ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   12    ║     IDE        ║ Поле IDE                                                                           ║
// ║         ║                ║ Поле, обозначающее формат пакета                                                   ║
// ║         ║                ║ 1 - расширенный пакет                                                              ║
// ║         ║                ║ 0 - стандартный пакет                                                              ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   11    ║     SSR        ║ Поле SSR, расширенного формата                                                     ║
// ║         ║                ║ Всегда должен быть "1"                                                             ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   10    ║     R0         ║ Поле R0                                                                            ║
// ║         ║                ║ Всегда должен быть "0"                                                             ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   9     ║     R1         ║ Поле R1, расширенного формата.                                                     ║
// ║         ║                ║ Всегда должен быть "1"                                                             ║
// ║         ║                ║                                                                                    ║
// ║         ║                ║                                                                                    ║
// ║         ║                ║                                                                                    ║
// ║         ║                ║                                                                                    ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   8     ║     RTR        ║ Поле RTR, запроса обратного ответа                                                 ║
// ║         ║                ║ 0 - нет запроса                                                                    ║
// ║         ║                ║ 1 - есть запрос                                                                    ║
// ║         ║                ║ Если узел получил пакет с запросом обратного ответа, он должен ответить.           ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║  7..4   ║                ║ Зарезервировано                                                                    ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║  3..0   ║     DLC[3:0]   ║ Поле DLC, длина передаваемых данных в пакете                                       ║
// ║         ║                ║ 0000 - нет данных                                                                  ║
// ║         ║                ║ 0001 - 1 байт                                                                      ║
// ║         ║                ║ 0010 - 2 байт                                                                      ║
// ║         ║                ║ 0011 - 3 байт                                                                      ║
// ║         ║                ║ 0100 - 4 байт                                                                      ║
// ║         ║                ║ 0101 - 5 байт                                                                      ║
// ║         ║                ║ 0110 - 6 байт                                                                      ║
// ║         ║                ║ 0111 - 7 байт                                                                      ║
// ║         ║                ║ 1000 - 8 байт                                                                      ║
// ║         ║                ║ 1xxx - недопустимо                                                                 ║
// ╚═════════╩════════════════╩════════════════════════════════════════════════════════════════════════════════════╝
	CAN1->BUF_02_DATAL = 0x00000000; // Данные сообщения буфера 02 
	CAN1->BUF_02_DATAH = 0x00000000; // Данные сообщения буфера 02 
 
	CAN1->BUF_01_MASK = 0x7F8<<18;
	CAN1->BUF_01_FILTER = 0x550<<18;

	CAN1->CONTROL = 0x00000009;				//CAN1 enable
// CAN1->CONTROL - Регистр управления линией
// ╔═════════╦════════════════╦════════════════════════════════════════════════════════════════════════════════════╗
// ║ 	 Биты  ║ Поле           ║                 Назначение                                                         ║
// ╠═════════╬════════════════╬════════════════════════════════════════════════════════════════════════════════════╣
// ║ 31..5   ║                ║ Зарезервировано                                                                    ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   4     ║    ROP         ║ Receive own packets                                                                ║
// ║         ║                ║ 1 - контроллер принимает собственные пакеты                                        ║
// ║         ║                ║ 0 - контроллер принимает только чужие пакеты                                       ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   3     ║    SAP         ║ Send ACK on own packets                                                            ║
// ║         ║                ║ 1 - контроллер подтверждает приём собственных пакетов                              ║
// ║         ║                ║ 0 - контроллер подтверждает приём только чужих пакетов                             ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   2     ║    STM         ║ Self Test Mode                                                                     ║
// ║         ║                ║ 1 - контроллер работает в режиме самотестирования                                  ║
// ║         ║                ║ 0 - контроллер работает в нормальном режиме                                        ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   1     ║    ROM         ║ Read Only Mode                                                                     ║
// ║         ║                ║ 1 - контроллер работает только на приём                                            ║
// ║         ║                ║ 0 - контроллер работает в нормальном режиме                                        ║
// ╟─────────╫────────────────╫────────────────────────────────────────────────────────────────────────────────────╢
// ║   0     ║    CAN_EN      ║ Режим работы контроллера CAN                                                       ║
// ║         ║                ║ 1 - разрешение работы                                                              ║
// ║         ║                ║ 0 - сброс                                                                          ║
// ╚═════════╩════════════════╩════════════════════════════════════════════════════════════════════════════════════╝
#else
	
#ifdef REVISION_2

	#ifdef SPEED_1000K
		CAN2->BITTMNG = 0x08900002;			//CAN2 speed 1 Mbit/s	
	#endif	//SPEED_1000K
		
	#ifdef SPEED_500K
		CAN2->BITTMNG =	0x08900005;			//CAN2 speed 500 kbit/s
	#endif	//SPEED_500K

	#ifdef SPEED_250K
		CAN2->BITTMNG =	0x0890000B;			//CAN2 speed 250 kbit/s
	#endif	//SPEED_250K

#else

	#ifdef SPEED_1000K
		CAN2->BITTMNG = 0x01FF0000;			//CAN2 speed 1 Mbit/s
	#endif	//SPEED_1000K

	#ifdef SPEED_500K
		CAN2->BITTMNG =	0x01FF0001;			//CAN2 speed 500 kbit/s
	#endif	//SPEED_500K

	#ifdef SPEED_250K
		CAN2->BITTMNG =	0x01FF0003;			//CAN2 speed 250 kbit/s
	#endif	//SPEED_250K
#endif	//REVISION_2

	CAN2->BUF_01_CON = 0x00000003;		//Buffer 1 - Rx and enable
	CAN2->BUF_02_CON = 0x00000001;		//Buffer 2 - Tx and enable
	CAN2->INT_EN = 0;					//all interrupts disable

	CAN2->INT_RX = 0;					//Rx interrupts disable
	CAN2->INT_TX = 0;					//Tx interrupts disable
	
	CAN2->BUF_02_ID = 0x555<<18;		// 10101010101 - SID; 0 - EID
	CAN2->BUF_02_DLC = 0x00000A08;		// IDE = 0; SSR = 1; R0 = 0; R1 = 1; RTR = 0; DLC = 8 bytes

	CAN2->BUF_02_DATAL = 0x00000000;
	CAN2->BUF_02_DATAH = 0x00000000;

	CAN2->BUF_01_MASK = 0x7F8<<18;
	CAN2->BUF_01_FILTER = 0x550<<18;

	CAN2->CONTROL = 0x00000009;				//CAN2 enable
#endif	//CAN_1 == 1
}

#endif // __CAN1_c__
