#ifndef __TERMINAL_c__
#define __TERMINAL_c__

#include "opora.h"
#include "TERMINAL.h"


//--- Terminal configuration ---
void Menu()
{

}


void Menu1(char a)
 
 {
//***************************************************************************

    int i;
	
 
 //   for (i=0;i<20;i++) Transf("\r");    // очистка терминала
	for (i=0; i<20; i++) Transf ("-");  // вывод приветствия
	Transf("\r");
	Transf("..........Terminal К614.........\r\n");
	Transf("\r");
	Transf("MENU :\r");
	Transf("-------\r");
	Transf("Расшифровка структуры команды:\r");
	Transf("~ - стартовый байт\r");
	Transf("1 - адрес абонента\r");
	Transf("Установить_F0 -  команда\r");
	Transf("=30000000 - данные команды\r");
	Transf(";- конец пачки \r");
	Transf(".............. \r");
	Transf("Адреса: \r");
	Transf("1 - 5У-К614   , синхронизатор : \r");
	Transf("3 - 5У-К612   , синтезатор частоты излучения  \r");
	Transf("4 - 5У-К612-1 , синтезатор частоты гетеродина \r");
	Transf("6 - 5У-К611   , формирователь опорных частот  \r");
	Transf("---------------------------------------------\r\n");
	Transf("IP  :192.168.1.163 - IP адрес    блока\r");
	Transf("PORT:2054          - номер порта блока\r");
	Transf("~1 help; - текущее меню\r");
//	Transf("~1 состояние; - выводит состояние блока\r");
	Transf("-------------------------------------------\r");
	Transf(" Синтезатор  5-У-К612\r");
	Transf("\r");
	Transf("~3 Установить_F0=430000000; в Гц\r");
	Transf("~3 Установить_частоту_F_low:430000000;   (для ЛЧМ)\r");
	Transf("~3 Установить_частоту_F_high:432000000;  (для ЛЧМ)\r");
	Transf("~3 Установить_Амплитуду:15;	в ДБм\r");
	Transf("~3 Установить_девиацию_ЛЧМ:2000000; в Гц (для ЛЧМ)\r");
	Transf("~3 Длительность_импульса_Tимп:10;  в мкс (для ЛЧМ)\r");
	Transf("~3 Частота_повторения_Fимп:100000;  в Гц (для ЛЧМ)\r");
	Transf("~3 Установить_ЛЧМ; - включает ЛЧМ сигнал\r");
	Transf("-------------------------------------------\r");
	Transf(" Гетеродин  5-У-К612-1\r");
	Transf("\r");
	Transf("~4 Установить_F0=430000000; в Гц\r");
	Transf("~4 Установить_частоту_F_low:430000000;   (для ЛЧМ)\r");
	Transf("~4 Установить_частоту_F_high:432000000;  (для ЛЧМ)\r");
	Transf("~4 Установить_Амплитуду:15;	в ДБм\r");
	Transf("~4 Установить_девиацию_ЛЧМ:2000000; в Гц (для ЛЧМ)\r");
	Transf("~4 Длительность_импульса_Tимп:10;  в мкс (для ЛЧМ)\r");
	Transf("~4 Частота_повторения_Fимп:100000;  в Гц (для ЛЧМ)\r");
	Transf("~4 Установить_ЛЧМ; - включает ЛЧМ сигнал\r");
	Transf("\r");
	Transf("\r");
	Transf("++++++++++++++++++++\r");
	Transf("\r");
	Transf("\r");
	//for (i=0; i<64; i++) zputs ("*",1);  // вывод приветствия
	//for (i=0;i<10;i++) puts("\r",1);  // очистка терминала
	Transf("\r");
	//*******************************************************************************


	
	}



#endif // __TERMINAL_c__
